УТ_для_edt/src/InformationRegisters/смартСформированныеУведомления/смартСформированныеУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартСформированныеУведомления</name>
  <resources>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тело</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПолучателиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучателиКопии</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПолучателиКопииСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучателиСкрытые</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПолучателиСкрытыеСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипТекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Уведомление</name>
    <type>
      <types>CatalogRef.смартУведомления</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </resources>
  <resources>
    <name>СпособУведомления</name>
    <type>
      <types>EnumRef.смартСпособыУведомлений</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеПараметры</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Вложения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартУведомленияПоСобытиям/смартУведомленияПоСобытиям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартУведомленияПоСобытиям</name>
  <resources>
    <name>Уведомление</name>
    <type>
      <types>CatalogRef.смартУведомления</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникСсылка</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникНаборЗаписей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.смартВидыСобытийОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСпособыУведомлений/смартСпособыУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСпособыУведомлений</name>
  <enumValues>
    <name>Почта</name>
  </enumValues>
  <enumValues>
    <name>Телеграмм</name>
  </enumValues>
  <enumValues>
    <name>ЗадачаУТ</name>
  </enumValues>
  <enumValues>
    <name>НапоминаниеУТ</name>
  </enumValues>
  <enumValues>
    <name>ЛичноеСообщениеБ24</name>
    <comment>#5480 смарт: Тимофеева 28.01.26 / Рассылка уведомлений. Доработать систему для отправки уведомлений в Битрикс24</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартВидыСобытийОбъектов/смартВидыСобытийОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыСобытийОбъектов</name>
  <enumValues>
    <name>ЗаписьОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>УдалениеОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПроведения</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <comment>АПК:58</comment>
  <predefined>
    <items>
      <name>СистемнаяУчетнаяЗаписьЭлектроннойПочты</name>
      <description>Системная учетная запись</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииСообщенийНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодХраненияСообщенийНаСервере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераВходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераИсходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходНаСерверПередОтправкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьСкрытыеКопииПисемНаЭтотАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецУчетнойЗаписи</name>
    <comment>АПК:58</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ДатаНачальнойЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НастройкаСинхронизацииСВнешнимПриложением</name>
    <type>
      <types>CatalogRef.CRM_ПрограммыMSOutlook</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПодписьВнизуПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешитьПросмотрПисемВсемПользователям</name>
    <comment>Разрешить просмотр писем всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВыгружатьВiCRM</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЭтоОбщаяУчетнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СинхронизироватьПапкиСПочтовымСервером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтображатьТолькоПодписанныеПапки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПереноситьВОбработанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЗадаватьВопросПриПереносеВОбработанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриОтправкеПисемТребуетсяАвторизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартУведомления/смартУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартУведомления</name>
  <comment>//++ #Б2764 смарт: Шляпников 03.04.2025 / Автоматические уведомления для менеджеров.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидУведомления</name>
    <type>
      <types>EnumRef.смартВидыУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Настройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаВыполнения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияОФайле</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СобытияОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСобытия</name>
      <type>
        <types>EnumRef.смартВидыСобытийОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/смартУведомления/Module.bsl
/////////////////////////////////////////////////////////////////////////////
// Модуль смартУведомления предназначен для 
// хранения процедур и функций, связанных с отправкой уведомлений 
// 
// Модуль создал - Шляпников, 01.04.2025
/////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет к отправке уведомление по объекту
//
// Параметры:
//  - Объект - документ, справочник или другой ссылочный объект, по котрому отправляется уведомление
//	- ВидСобытия - строка, идентификатор события по которому идет отправка
//	- Тема - строка, тема письма
//	- Тело - строка, тело письма
//	- Получатели - массив структур ("Адрес, Представление")
//
Процедура ОтправитьПочтовоеУведомление(Объект, ВидСобытия, Тема, Тело, Получатели, ПолучателиКопии = Неопределено, ПолучателиСкрытые = Неопределено, Вложения = Неопределено, ТипТекста = Неопределено, УчетнаяЗапись = Неопределено, ДатаУведомления = Неопределено, Уведомление = Неопределено, Единственное = Истина, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДатаФормирования = ТекущаяДатаСеанса();
	
	НаборЗаписей = РегистрыСведений.смартСформированныеУведомления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект, Истина);
	НаборЗаписей.Отбор.ВидСобытия.Установить(ВидСобытия, Истина);
	НаборЗаписей.Отбор.ДатаФормирования.Установить(ДатаФормирования, Истина);
	
	Запись = НаборЗаписей.Добавить();
	Запись.СпособУведомления = Перечисления.смартСпособыУведомлений.Почта;
	Запись.Объект = Объект;
	Запись.ВидСобытия = ВидСобытия;
	Запись.ДатаФормирования = ДатаФормирования;
	Запись.Тема = Тема;
	Запись.Тело = Тело;
	Запись.ТипТекста = ТипТекста;
	Запись.Получатели = ЗначениеВСтрокуВнутр(Получатели);
	Запись.ПолучателиКопии = ЗначениеВСтрокуВнутр(ПолучателиКопии);
	Запись.ПолучателиСкрытые = ЗначениеВСтрокуВнутр(ПолучателиСкрытые);
	Запись.Уведомление = Уведомление;
	Запись.ДатаУведомления = ДатаУведомления;
	Запись.ДополнительныеПараметры = ДополнительныеПараметры;
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	
	Если НЕ Единственное Тогда
		
		ИдентификаторУведомления = СокрЛП(Новый УникальныйИдентификатор);
		НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторУведомления, Истина);
		Запись.Идентификатор = ИдентификаторУведомления;
		
	КонецЕсли;
	
	МассивПредставлений = Новый Массив;
	Для каждого стрПолучатель Из Получатели Цикл
		МассивПредставлений.Добавить(СтрШаблон("%1 <%2>", стрПолучатель.Представление, стрПолучатель.Адрес));
	КонецЦикла;
	Запись.ПолучателиСтрокой = СтрСоединить(МассивПредставлений, ";");
	
	Если ЗначениеЗаполнено(ПолучателиКопии) Тогда
		
		МассивПредставлений = Новый Массив;
		Для каждого стрПолучатель Из ПолучателиКопии Цикл
			МассивПредставлений.Добавить(СтрШаблон("%1 <%2>", стрПолучатель.Представление, стрПолучатель.Адрес));
		КонецЦикла;
		Запись.ПолучателиКопииСтрокой = СтрСоединить(МассивПредставлений, ";");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолучателиСкрытые) Тогда
		
		МассивПредставлений = Новый Массив;
		Для каждого стрПолучатель Из ПолучателиСкрытые Цикл
			МассивПредставлений.Добавить(СтрШаблон("%1 <%2>", стрПолучатель.Представление, стрПолучатель.Адрес));
		КонецЦикла;
		Запись.ПолучателиСкрытыеСтрокой = СтрСоединить(МассивПредставлений, ";");
		
	КонецЕсли;
	
	Если НЕ Вложения = Неопределено Тогда
		
		МассивФайлов = Новый Массив;
		
		Для каждого стрВложение Из Вложения Цикл
			
			ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
			ПараметрыФайла.ВладелецФайлов = ПолучитьПапкуДляФайлов();
			ПараметрыФайла.ИмяБезРасширения = стрВложение.ИмяФайла;
			ПараметрыФайла.РасширениеБезТочки = стрВложение.РасширениеФайла;
			
			Файл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, стрВложение.Адрес);
			
			МассивФайлов.Добавить(Файл);
			
		КонецЦикла;
		
		Запись.Вложения = ЗначениеВСтрокуВнутр(МассивФайлов);
		
	КонецЕсли;
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ОтправитьУведомлениеНапоминанием(Объект, ВидСобытия, Тема, Тело, Получатели, ДатаУведомления = Неопределено, Уведомление = Неопределено, Единственное = Истина, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДатаФормирования = ТекущаяДатаСеанса();
	
	НаборЗаписей = РегистрыСведений.смартСформированныеУведомления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект, Истина);
	НаборЗаписей.Отбор.ВидСобытия.Установить(ВидСобытия, Истина);
	НаборЗаписей.Отбор.ДатаФормирования.Установить(ДатаФормирования, Истина);
	
	Запись = НаборЗаписей.Добавить();
	Запись.СпособУведомления = Перечисления.смартСпособыУведомлений.НапоминаниеУТ;
	Запись.Объект = Объект;
	Запись.ВидСобытия = ВидСобытия;
	Запись.ДатаФормирования = ДатаФормирования;
	Запись.Тема = Тема;
	Запись.Тело = Тело;
	Запись.Получатели = ЗначениеВСтрокуВнутр(Получатели);
	Запись.Уведомление = Уведомление;
	Запись.ДатаУведомления = ДатаУведомления;
	Запись.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если НЕ Единственное Тогда
		
		ИдентификаторУведомления = СокрЛП(Новый УникальныйИдентификатор);
		НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторУведомления, Истина);
		Запись.Идентификатор = ИдентификаторУведомления;
		
	КонецЕсли;
	
	МассивПредставлений = Новый Массив;
	Для каждого стрПолучатель Из Получатели Цикл
		МассивПредставлений.Добавить(СокрЛП(стрПолучатель));
	КонецЦикла;
	Запись.ПолучателиСтрокой = СтрСоединить(МассивПредставлений, ";");
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Возвращает информацию о последнем отправленном уведомлении
//
// Параметры:
//  - Объект - документ, справочник или другой ссылочный объект, по котрому было отправлено уведомление
//	- ВидСобытия - строка, идентификатор события по которому была отправка отправка
//
// Возвращаемое значение
//	- Структура
//
Функция ПолучитьИнформациюОПоследнемУведомлении(Объект, ВидСобытия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.смартСформированныеУведомления КАК смартСформированныеУведомления
	|ГДЕ
	|	смартСформированныеУведомления.Объект = &Объект
	|	И смартСформированныеУведомления.ВидСобытия = &ВидСобытия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаФормирования УБЫВ";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
	
	Результат = смартОбщегоНазначения.СоздатьСтруктуруПоРегиструСведений("смартСформированныеУведомления");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьВложениеДляОтправкиУведомления(Данные, ИмяФайла, Расширение) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяФайла", ИмяФайла);
	Результат.Вставить("РасширениеФайла", Расширение);
	
	Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
		Результат.Вставить("Адрес", ПоместитьВоВременноеХранилище(Данные));
	Иначе
		Результат.Вставить("Адрес", Данные);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОтредактироватьУведомление(Объект, ВидСобытия, ДатаФормирования, Идентификатор, Тема = Неопределено, Тело = Неопределено, Получатели = Неопределено, ПолучателиКопии = Неопределено, ПолучателиСкрытые = Неопределено, Вложения = Неопределено, ТипТекста = Неопределено, УчетнаяЗапись = Неопределено, ДатаУведомления = Неопределено, Уведомление = Неопределено, Отправлено = Неопределено, СпособУведомления = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.смартСформированныеУведомления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект, Истина);
	НаборЗаписей.Отбор.ВидСобытия.Установить(ВидСобытия, Истина);
	НаборЗаписей.Отбор.ДатаФормирования.Установить(ДатаФормирования, Истина);
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор, Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запись = НаборЗаписей[0];
	Если НЕ СпособУведомления = Неопределено Тогда
		Запись.СпособУведомления = СпособУведомления;
	КонецЕсли;
	
	Если НЕ Тема = Неопределено Тогда
		Запись.Тема = Тема;
	КонецЕсли;
	
	Если НЕ Тело = Неопределено Тогда
		Запись.Тело = Тело;
	КонецЕсли;
	
	Если НЕ ТипТекста = Неопределено Тогда
		Запись.ТипТекста = ТипТекста;
	КонецЕсли;
	
	Если НЕ Получатели = Неопределено Тогда
		
		Запись.Получатели = ЗначениеВСтрокуВнутр(Получатели);
		
		МассивПредставлений = Новый Массив;
		Для каждого стрПолучатель Из Получатели Цикл
			МассивПредставлений.Добавить(СтрШаблон("%1 <%2>", стрПолучатель.Представление, стрПолучатель.Адрес));
		КонецЦикла;
		Запись.ПолучателиСтрокой = СтрСоединить(МассивПредставлений, ";");
		
	КонецЕсли;
	
	Если НЕ ПолучателиКопии = Неопределено Тогда
		
		Запись.ПолучателиКопии = ЗначениеВСтрокуВнутр(ПолучателиКопии);
		
		Если ЗначениеЗаполнено(ПолучателиКопии) Тогда
		
			МассивПредставлений = Новый Массив;
			Для каждого стрПолучатель Из ПолучателиКопии Цикл
				МассивПредставлений.Добавить(СтрШаблон("%1 <%2>", стрПолучатель.Представление, стрПолучатель.Адрес));
			КонецЦикла;
			Запись.ПолучателиКопииСтрокой = СтрСоединить(МассивПредставлений, ";");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПолучателиСкрытые = Неопределено Тогда
		
		Запись.ПолучателиСкрытые = ЗначениеВСтрокуВнутр(ПолучателиСкрытые);
		
		Если ЗначениеЗаполнено(ПолучателиСкрытые) Тогда
		
			МассивПредставлений = Новый Массив;
			Для каждого стрПолучатель Из ПолучателиСкрытые Цикл
				МассивПредставлений.Добавить(СтрШаблон("%1 <%2>", стрПолучатель.Представление, стрПолучатель.Адрес));
			КонецЦикла;
			Запись.ПолучателиСкрытыеСтрокой = СтрСоединить(МассивПредставлений, ";");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Уведомление = Неопределено Тогда
		Запись.Уведомление = Уведомление;
	КонецЕсли;
	
	Если НЕ ДатаУведомления = Неопределено Тогда
		Запись.ДатаУведомления = ДатаУведомления;
	КонецЕсли;
	
	Если НЕ ДополнительныеПараметры = Неопределено Тогда
		Запись.ДополнительныеПараметры = ДополнительныеПараметры;
	КонецЕсли;
	
	Если НЕ УчетнаяЗапись = Неопределено Тогда
		Запись.УчетнаяЗапись = УчетнаяЗапись;
	КонецЕсли;
	
	Если НЕ Отправлено = Неопределено Тогда
		
		Запись.Отправлено = Отправлено;
		Если НЕ Отправлено Тогда
			
			Запись.ДатаОтправки = 0;
			Запись.КоличествоПопыток = 0;
			Запись.Ошибка = Ложь;
			Запись.ТекстОшибки = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Вложения = Неопределено Тогда
		
		МассивФайлов = Новый Массив;
		
		Для каждого стрВложение Из Вложения Цикл
			
			ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
			ПараметрыФайла.ВладелецФайлов = ПолучитьПапкуДляФайлов();
			ПараметрыФайла.ИмяБезРасширения = стрВложение.ИмяФайла;
			ПараметрыФайла.РасширениеБезТочки = стрВложение.РасширениеФайла;
			
			Файл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, стрВложение.Адрес);
			
			МассивФайлов.Добавить(Файл);
			
		КонецЦикла;
		
		Запись.Вложения = ЗначениеВСтрокуВнутр(МассивФайлов);
		
	КонецЕсли;
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать(Истина);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область РегламентныеЗадания

// Отправляет неоправленные ранее уведомления
//
// Параметры:
//  Нет
//
Процедура смартОтправкаУведомлений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.смартСформированныеУведомления КАК смартСформированныеУведомления
	|ГДЕ
	|	НЕ смартСформированныеУведомления.Отправлено
	|	И смартСформированныеУведомления.КоличествоПопыток <= &КоличествоПопыток
	|	И смартСформированныеУведомления.ДатаУведомления <= &ДатаУведомления";	
		
	Запрос.УстановитьПараметр("ДатаУведомления", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("КоличествоПопыток", смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("КоличествоПопытокОтправкиУведомлений", 3));

	//++ #5172 смарт: Тимофеева 08.12.2025 / Регламентное задание "Отправка уведомлений (смарт)". 
	Запрос.Текст = Запрос.Текст + "
	|	И НЕ (ВЫРАЗИТЬ(смартСформированныеУведомления.Получатели КАК СТРОКА(100))) = """"
	|;
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.смартСформированныеУведомления КАК смартСформированныеУведомления
	|ГДЕ
	|	НЕ смартСформированныеУведомления.Отправлено
	|	И смартСформированныеУведомления.КоличествоПопыток <= 1
	|	И смартСформированныеУведомления.ДатаУведомления <= &ДатаУведомления
	|	И (ВЫРАЗИТЬ(смартСформированныеУведомления.Получатели КАК СТРОКА(100))) = """"";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекстОшибки = СтрШаблон("Нет получателей в сформированном уведомлении по объекту %1
								|вид события - %2
								|дата формирования - %3
								|тема - %4",
								Выборка.Объект,
								Выборка.ВидСобытия,
								Выборка.ДатаФормирования,
								Выборка.Тема);
		
		НаборЗаписей = РегистрыСведений.смартСформированныеУведомления.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект, Истина);
		НаборЗаписей.Отбор.ВидСобытия.Установить(Выборка.ВидСобытия, Истина);
		НаборЗаписей.Отбор.ДатаФормирования.Установить(Выборка.ДатаФормирования, Истина);
		НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор, Истина);
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Запись.Ошибка = Истина;
		Запись.ТекстОшибки = "Нет получателей";
		Запись.КоличествоПопыток = 1;
		
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать(Истина);
		
		ЗаписьЖурналаРегистрации("смартУведомления", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
	КонецЦикла;

	//-- #5172 смарт: Тимофеева 08.12.2025  
	
	//++ #5172 смарт: Тимофеева 08.12.2025 / Регламентное задание "Отправка уведомлений (смарт)".
	//Выборка = Запрос.Выполнить().Выбрать();
	Выборка = РезультатЗапроса[0].Выбрать();
	//-- #5172 смарт: Тимофеева 08.12.2025
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СпособУведомления = Перечисления.смартСпособыУведомлений.Почта Тогда
			
			Попытка
				Получатели = ЗначениеИзСтрокиВнутр(Выборка.Получатели);
				ПолучателиКопии = ЗначениеИзСтрокиВнутр(Выборка.ПолучателиКопии);
				ПолучателиСкрытые = ЗначениеИзСтрокиВнутр(Выборка.ПолучателиСкрытые); 
								
				ПараметрыПисьма = Новый Структура;
				ПараметрыПисьма.Вставить("Кому", Получатели);
				ПараметрыПисьма.Вставить("Копии", ПолучателиКопии);
				ПараметрыПисьма.Вставить("СкрытыеКопии", ПолучателиСкрытые);
				ПараметрыПисьма.Вставить("ПолучателиСообщения", Получатели);
				ПараметрыПисьма.Вставить("Тема", Выборка.Тема);
				ПараметрыПисьма.Вставить("Тело", Выборка.Тело);
				ПараметрыПисьма.Вставить("ТипТекста", ?(ЗначениеЗаполнено(Выборка.ТипТекста), 
														Выборка.ТипТекста, 
														Неопределено));
				
				Если ЗначениеЗаполнено(Выборка.Вложения) Тогда
					
					ПараметрыПисьма.Вставить("Вложения", Новый Массив);
					Вложения = ЗначениеИзСтрокиВнутр(Выборка.Вложения);
					
					Для каждого стрФайл Из Вложения Цикл
						
						ДанныеФайла = Новый Структура;
						ДанныеФайла.Вставить("Представление", СтрШаблон("%1.%2", стрФайл.Наименование, стрФайл.Расширение));
						ДанныеФайла.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(РаботаСФайлами.ДвоичныеДанныеФайла(стрФайл)));
						
						ПараметрыПисьма.Вложения.Добавить(ДанныеФайла);
						
					КонецЦикла;
					
				КонецЕсли;
				
				Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыПисьма);
				
			Исключение
				
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
				НаборЗаписей = РегистрыСведений.смартСформированныеУведомления.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект, Истина);
				НаборЗаписей.Отбор.ВидСобытия.Установить(Выборка.ВидСобытия, Истина);
				НаборЗаписей.Отбор.ДатаФормирования.Установить(Выборка.ДатаФормирования, Истина);
				НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор, Истина);
				
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				
				Запись.Ошибка = Истина;
				Запись.ТекстОшибки = ТекстОшибки;
				Запись.КоличествоПопыток = Запись.КоличествоПопыток + 1;
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				
				ЗаписьЖурналаРегистрации("смартУведомления.ОтправкаУведомленийПоПочте", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
				
				Продолжить;
				
			КонецПопытки;
			
			Попытка
				
				Если НЕ ЗначениеЗаполнено(Выборка.УчетнаяЗапись) Тогда
					УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
				Иначе
					УчетнаяЗапись = Выборка.УчетнаяЗапись;
				КонецЕсли;
				
				РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗапись, Письмо);
				
				ДатаОтправки = ТекущаяДатаСеанса();
		
				НаборЗаписей = РегистрыСведений.смартСформированныеУведомления.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект, Истина);
				НаборЗаписей.Отбор.ВидСобытия.Установить(Выборка.ВидСобытия, Истина);
				НаборЗаписей.Отбор.ДатаФормирования.Установить(Выборка.ДатаФормирования, Истина);
				НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор, Истина);
				
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				
				Запись.Отправлено = Истина;
				Запись.ДатаОтправки = ДатаОтправки;
				Запись.УчетнаяЗапись = УчетнаяЗапись;
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				
			Исключение
				
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
				НаборЗаписей = РегистрыСведений.смартСформированныеУведомления.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект, Истина);
				НаборЗаписей.Отбор.ВидСобытия.Установить(Выборка.ВидСобытия, Истина);
				НаборЗаписей.Отбор.ДатаФормирования.Установить(Выборка.ДатаФормирования, Истина);
				НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор, Истина);
				
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				
				Запись.Ошибка = Истина;
				Запись.ТекстОшибки = ТекстОшибки;
				Запись.КоличествоПопыток = Запись.КоличествоПопыток + 1;
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				
				ЗаписьЖурналаРегистрации("смартУведомления.ОтправкаУведомленийПоПочте", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
				
			КонецПопытки;
			
		ИначеЕсли Выборка.СпособУведомления = Перечисления.смартСпособыУведомлений.НапоминаниеУТ Тогда
			
			Получатели = ЗначениеИзСтрокиВнутр(Выборка.Получатели);
			
			Для каждого стрПолучатель Из Получатели Цикл
				
				ВремяСобытия = ТекущаяДатаСеанса();
				
				НаборЗаписей = РегистрыСведений.НапоминанияПользователя.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Пользователь.Установить(стрПолучатель, Истина);
				НаборЗаписей.Отбор.ВремяСобытия.Установить(ВремяСобытия, Истина);
				НаборЗаписей.Отбор.Источник.Установить(Выборка.Объект, Истина);
				
				Запись = НаборЗаписей.Добавить();
				Запись.Пользователь = стрПолучатель;
				Запись.ВремяСобытия = ВремяСобытия;
				Запись.Источник = Выборка.Объект;
				Запись.СрокНапоминания = ?(ЗначениеЗаполнено(Выборка.ДатаУведомления), Выборка.ДатаУведомления, ВремяСобытия);
				Запись.Описание = Выборка.Тело;
				Запись.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
			НаборЗаписей = РегистрыСведений.смартСформированныеУведомления.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект, Истина);
			НаборЗаписей.Отбор.ВидСобытия.Установить(Выборка.ВидСобытия, Истина);
			НаборЗаписей.Отбор.ДатаФормирования.Установить(Выборка.ДатаФормирования, Истина);
			НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор, Истина);
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Запись.Отправлено = Истина;
			Запись.ДатаОтправки = ТекущаяДатаСеанса();
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать(Истина);
			
		Иначе
			
			НаборЗаписей = РегистрыСведений.смартСформированныеУведомления.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект, Истина);
			НаборЗаписей.Отбор.ВидСобытия.Установить(Выборка.ВидСобытия, Истина);
			НаборЗаписей.Отбор.ДатаФормирования.Установить(Выборка.ДатаФормирования, Истина);
			НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор, Истина);
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Запись.Отправлено = Истина;
			Запись.ДатаОтправки = ТекущаяДатаСеанса();
			Запись.ТекстОшибки = "Неизвестный способ уведомления";
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура смартФормированиеУведомлений(Уведомление, ФормироватьВсегда = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Уведомление) ИЛИ НЕ ТипЗнч(Уведомление) = Тип("СправочникСсылка.смартУведомления") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление, "Использование") И НЕ ФормироватьВсегда Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаВыполнения = ОбъектОбработкиВыполнения(Уведомление);
	ОбработкаВыполнения.СформироватьУведомления(Уведомление);
	
КонецПроцедуры

Процедура смартФормированиеУведомленийПоСобытиям() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартУведомленияПоСобытиям.Идентификатор КАК Идентификатор,
	|	смартУведомленияПоСобытиям.Уведомление КАК Уведомление,
	|	смартУведомленияПоСобытиям.ИсточникСсылка КАК ИсточникСсылка,
	|	смартУведомленияПоСобытиям.ИсточникНаборЗаписей КАК ИсточникНаборЗаписей,
	|	смартУведомленияПоСобытиям.ВидСобытия КАК ВидСобытия,
	|	смартУведомленияПоСобытиям.Ответственный КАК Ответственный
	|ИЗ
	|	РегистрСведений.смартУведомленияПоСобытиям КАК смартУведомленияПоСобытиям";
	
	НаборЗаписей = РегистрыСведений.смартУведомленияПоСобытиям.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбработкаВыполнения = ОбъектОбработкиВыполнения(Выборка.Уведомление);
		
		ИсточникСобытия = Неопределено;
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор, Истина);
		
		Попытка
			
			Если ЗначениеЗаполнено(Выборка.ИсточникСсылка) Тогда
				ИсточникСобытия = Выборка.ИсточникСсылка;
			Иначе
				ИсточникСобытия = ЗначениеИзСтрокиВнутр(Выборка.ИсточникНаборЗаписей);
			КонецЕсли;
			
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ВидСобытия", Выборка.ВидСобытия);
			ДопПараметры.Вставить("Ответственный", Выборка.Ответственный);
			
			ОбработкаВыполнения.СформироватьУведомления(Выборка.Уведомление, ИсточникСобытия, ДопПараметры);
			
		Исключение
			
			ТекстОшибки = ОписаниеОшибки();
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Ошибка = Истина;
			Запись.ТекстОшибки = ТекстОшибки;
			
			ЗаписьЖурналаРегистрации("смартУведомления.ФормированиеУведомленийПоСобытиям", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			
		КонецПопытки;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСправочникомСмартУведомления

// Подключает и возвращает имя, под которым подключен внешний отчет или обработка.
// После подключения отчет или обработка регистрируется в программе под определенным именем,
// используя которое, можно создавать объект или открывать формы отчета или обработки.
//
// Параметры:
//   Ссылка - СправочникСсылка.смартУведомления - подключаемая обработка.
//
// Возвращаемое значение: 
//   Строка       - имя подключенного отчета или обработки.
//   Неопределено - если передана некорректная ссылка.
//
Функция ПодключитьОбработкуВыполнения(Ссылка) Экспорт
	
	Результат = Неопределено;
	
	// Проверка корректности переданных параметров.
	Если ТипЗнч(Ссылка) <> Тип("СправочникСсылка.смартУведомления") 
		Или Ссылка = Справочники.смартУведомления.ПустаяСсылка() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапуска = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ОбработкаВыполнения");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПараметрыЗапуска.ОбработкаВыполнения.Получить());
	
	ИмяОбработки = ВнешниеОбработки.Подключить(АдресВоВременномХранилище, , Ложь,
		ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
	Возврат ИмяОбработки;
	
КонецФункции

// Возвращает объект внешнего отчета или обработки.
//
// Параметры:
//   Ссылка - СправочникСсылка.смартУведомления - подключаемый отчет или обработка.
//
// Возвращаемое значение: 
//   ВнешняяОбработка - объект подключенной обработки.
//   Неопределено     - если передана некорректная ссылка.
//
Функция ОбъектОбработкиВыполнения(Ссылка) Экспорт
	
	Результат = Неопределено;
	
	// Подключение
	ИмяОбработки = ПодключитьОбработкуВыполнения(Ссылка);
	
	// Проверка корректности переданных параметров.
	Если ИмяОбработки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ВнешниеОбработки.Создать(ИмяОбработки);
	
КонецФункции

Функция ПолучитьНастройкиОбработкиВыполнения(Уведомление) Экспорт
	
	СохраненныеНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление, "Настройки");
	Возврат СохраненныеНастройки.Получить();
	
КонецФункции

Функция ПолучитьНастройкиОбработкиВыполненияПоИдентификатору(Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартУведомления.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартУведомления КАК смартУведомления
	|ГДЕ
	|	смартУведомления.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Ссылка <> NULL Тогда
		Уведомление = Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	СохраненныеНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление, "Настройки");
	Возврат СохраненныеНастройки.Получить();
	
КонецФункции

#КонецОбласти

#Область ПодпискиНаСобытия

Процедура СформироватьУведомленияПоСобытию(Источник, ВидСобытия, ЭтоРегистр = Ложь)
	
	ПолноеИмя = Источник.Метаданные().ПолноеИмя();
	Если ПолноеИмя = "Справочник.ВерсииРасширений" Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмя = Источник.Метаданные().ПолноеИмя();
	Если ПолноеИмя = "Справочник.ИдентификаторыОбъектовМетаданных" Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмя = Источник.Метаданные().ПолноеИмя();
	Если ПолноеИмя = "Справочник.ИдентификаторыОбъектовРасширений" Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Источник.Метаданные());
	МассивУведомлений = ПолучитьУведомленияПоСобытию(ИдентификаторМетаданных, ВидСобытия);
	
	ИсточникНаборЗаписей = Неопределено;
	ИсточникСсылка = Неопределено;
	
	Если ЭтоРегистр Тогда
		ИсточникНаборЗаписей = ЗначениеВСтрокуВнутр(Источник.Выгрузить());
	Иначе
		ИсточникСсылка = Источник.Ссылка;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.смартУведомленияПоСобытиям.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	Для каждого Уведомление Из МассивУведомлений Цикл
	
		НаборЗаписей.Очистить();
		ИДЗаписи = СокрЛП(Новый УникальныйИдентификатор);
		НаборЗаписей.Отбор.Идентификатор.Установить(ИДЗаписи, Истина);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Идентификатор = ИДЗаписи;
		Запись.Уведомление = Уведомление;
		Запись.ИсточникСсылка = ИсточникСсылка;
		Запись.ИсточникНаборЗаписей = ИсточникНаборЗаписей;
		Запись.ВидСобытия = ВидСобытия;
		Запись.Ответственный = Пользователи.АвторизованныйПользователь();
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура смартУведомленияПриЗаписиСсылочногоОбъектаПриЗаписи(Источник, Отказ) Экспорт
	
	СформироватьУведомленияПоСобытию(Источник, Перечисления.смартВидыСобытийОбъектов.ЗаписьОбъекта);
	
КонецПроцедуры

Процедура смартУведомленияПриЗаписиРегистраПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	СформироватьУведомленияПоСобытию(Источник, Перечисления.смартВидыСобытийОбъектов.ЗаписьОбъекта, Истина);
	
КонецПроцедуры

Процедура смартУведомленияПриПроведенииДокументаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	СформироватьУведомленияПоСобытию(Источник, Перечисления.смартВидыСобытийОбъектов.ПроведениеДокумента);
	
КонецПроцедуры

Процедура смартУведомленияПриОтменеПроведенияДокументаОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	СформироватьУведомленияПоСобытию(Источник, Перечисления.смартВидыСобытийОбъектов.ОтменаПроведения);
	
КонецПроцедуры

Процедура смартУведомленияПриУстановкиПометкиУдаленияПередУдалением(Источник, Отказ) Экспорт
	
	СформироватьУведомленияПоСобытию(Источник, Перечисления.смартВидыСобытийОбъектов.УдалениеОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Функция ПолучитьУведомленияПоСобытию(ИдентификаторМетаданных, ВидСобытия)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартУведомленияСобытияОбъектов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартУведомления.СобытияОбъектов КАК смартУведомленияСобытияОбъектов
	|ГДЕ
	|	смартУведомленияСобытияОбъектов.Объект = &Объект
	|	И смартУведомленияСобытияОбъектов.ВидСобытия = &ВидСобытия
	|	И смартУведомленияСобытияОбъектов.Ссылка.Использование";
	
	Запрос.УстановитьПараметр("Объект", ИдентификаторМетаданных);
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьПапкуДляФайлов()
	
	Возврат смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ПапкаФайловВложенийУведомлений");
	
КонецФункции

Функция СформироватьАдресаПолучателейДляОтправки(Массив) Экспорт
	
	МассивПользователей = Новый Массив;
	Результат = Новый Массив;
	
	Для каждого стрАдрес Из Массив Цикл
		
		Если ТипЗнч(стрАдрес) = Тип("Строка") Тогда
			Результат.Добавить(Новый Структура("Адрес,Представление", стрАдрес, стрАдрес));
		ИначеЕсли ТипЗнч(стрАдрес) = Тип("СправочникСсылка.Пользователи") Тогда
			МассивПользователей.Добавить(стрАдрес);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивПользователей.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, смартОбщегоНазначения.ПолучитьАдресаПользователей(МассивПользователей));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
